tests/load/websocket-stress.yml
config:
  target: "http://localhost:3000"
  phases:
    - name: "Ramp up"
      duration: 30
      arrivalRate: 1
      rampTo: 5
    - name: "Sustained load"
      duration: 60
      arrivalRate: 5
    - name: "Ramp down"
      duration: 10
      arrivalRate: 5
      rampTo: 1
  defaults:
    headers:
      Content-Type: "application/json"
  processor: "./ws-helpers.js"

before:
  flow:
    - function: "setupUsers"

after:
  flow:
    - function: "cleanupUserPool"

# Artillery's WS engine only reads the `connect` config from the FIRST step in
# the flow and opens the socket BEFORE running any other steps. We therefore
# use `connect.function` handlers that acquire a token and set wsArgs.target
# to the fully-qualified ws:// URL before the handshake.

scenarios:
  - name: "WebSocket connection and room join"
    engine: ws
    flow:
      - connect:
          function: "connectWithTokenAndRoom"
      - think: 1
      - send:
          payload: '{"type":"join","roomCode":"{{ roomCode }}"}'
      - think: 3

  - name: "WebSocket sustained connection"
    engine: ws
    flow:
      - connect:
          function: "connectWithToken"
      - think: 5